backend/controllers/CategoryController.php

SELECT COUNT(*) FROM `s_category`
SELECT * FROM `s_category` LIMIT 10
---
    public function actionIndex()
    {
        $model = Category::find();
        $pagination = new Pagination(['totalCount' => $model->count(), 'pageSize' => 10]);
        $result = $model->offset($pagination->offset)->limit($pagination->limit)->all();