backend/controllers/UserController.php

    public function actionIndex()
    {
        $model = User::find();
        $pagination = new Pagination(['totalCount' => $model->count() , 'pageSize' => 10]);
        $result = $model->offset($pagination->offset)->limit($pagination->limit)->all();
---
SELECT COUNT(*) FROM `s_user`
SELECT * FROM `s_user` LIMIT 10