common/models/Category.php

    public static function getParentCategorys()
    {
        $data = self::find()->where(['pid' => 0])->asArray()->all();
---
SELECT * FROM `s_category` WHERE `pid`=0